package _2_Test_260114.book;

import java.util.Scanner;

public class _1_Ex {
    public static void main(String[] args) {
//        예제 3-1: for문을 이용하여 1부터 10까지 합 출력하기
//        문제: for문을 이용하여 1부터 10까지 덧셈으로 표시하고 합을 출력하라.
        int sum = 0;

        for (int i = 1; i <= 10; i++) {
            sum += sum + i;
        }
        System.out.println("1부터 10까지 합 : " + sum);

//        예제 3-2: while문을 이용하여 입력된 정수의 평균 구하기
//        문제: while문을 이용하여 정수를 여러 개 입력 받고 평균을 출력하라. 0이 입력되면 입력을 종료한다.
//        Scanner sc2 = new Scanner(System.in);
//        int num2 = 0;
//        int count = 0;
//
//        while(numAll ){
//            int numAll = num2.nextInt();
//
//        }

//        예제 3-3 : do-while문을 이용하여 'a'에서 'z'까지 출력하기
//        문제: do-while문을 이용하여 'a'부터 'z'까지 출력하는 프로그램을 작성하라.

//        예제 3-4 : 2중 중첩을 이용한 구구단 출력하기
//        문제: 2중 중첩된 for문을 이용하여 구구단을 출력하는 프로그램을 작성하라.

//        예제 3-5 : continue문을 이용하여 양수 합 구하기
//        문제: 5개의 정수를 입력 받고 양수 합을 구하여 출력하는 프로그램을 작성하라.

//        예제 3-6 : break문을 이용하여 while문 벗어나기
//        문제:"exit"이 입력되면 while문을 벗어나도록 break문을 활용하는 프로그램을 작성하라.

//        예제 3-7 : 배열 선언 및 생성
//        문제:양수 5개를 입력 받아 배열에 저장하고, 제일 큰 수를 출력하는 프로그램을 작성하라.

//        예제 3-8 : 배열의 length필드 활용
//        문제: 배열의 length 필드를 이용하여 배열 크기만큼 정수를 입력 받고 평균을 출력하라.

//        예제 3-9 : for-each문 활용
//        문제: for-each문을 활용하여 int [] 배열의 합을 구하고, String[] 배열의 문자열을 출력하는 사례를 보인다.

//        예제 3-10 : 2차원 배열 생성 및 활용하기
//        문제: 2차원 배열에 학년별로 1, 2학기 성적을 저장하고, 4년 전체 평점 평균을 출력하라.

//        예제 3-11 : 배열 리턴
//        문제: 일차원 정수 배열을 생성하여 리턴하는 makeArray()를 작성하고, 이 메소드로부터 배열을 전달받는 프로그램을 작성하라.


//        예제 3-12 : 0으로 나누기 시 예외 발생으로 응용프로그램이 강제 종료되는 경우
//        문제: 두정수를 입력받아 나눗셈을 하고 몫을 구하는 프로그램 코드이다 . 사용자가 나누는 수에 0 을 입력하면 자바 플랫폼에 의해 예외가 발생하여 프로그램이 강제 종료된다.


//        예제 3-13 : 0으로 나누는 예외에 대처하는 try-catch블록 만들기
//        문제:try-catch-finally 블록을 이용하여 예제 3-12를 수정하여, 저우를 0으로 나누는 경우에 "0으로 나눌 수 없습니다!"를 출력하는 프로그램을 작성하라.




//        예제 3-14 : 입력오류시 발생하는 예외(InputMismatchException)
//        문제:Scanner 클래스를 이용하여 3 개의 정수를 입력받아 합을 구하는 프로그램을 작성하라 .
//        사용자가 정수가 아닌 문자를 입력할 때 발생하는 InputMismatchException 예외를 처리하여 다시 입력받도록 하라.





    }
}
